Revit 2027 API
LayoutRuleFixedNumber Constructor
Constructor of LayoutRuleFixedNumber.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LayoutRuleFixedNumber(
	int numberOfLines
)
Public Sub New (
	numberOfLines As Integer
)
public:
LayoutRuleFixedNumber(
	int numberOfLines
)
new :
        numberOfLines : int -> LayoutRuleFixedNumber
Parameters
numberOfLines Int32
 The value of numberOfLines must be positive.
Remarks
Create a LayoutRuleFixedNumber object with the number of the beams and this number must be positive.
See Also
Reference
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace